benchmarks/logs/2026-04-29_11-27-54/burst_get_index.txt
Running 30s test @ http://localhost:8080/
  2 threads and 10 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   508.08us  709.61us  11.51ms   92.22%
    Req/Sec    14.30k     1.74k   16.88k    55.00%
  Latency Distribution
     50%  296.00us
     75%  411.00us
     90%  574.00us
     99%    3.86ms
  854103 requests in 30.01s, 0.86GB read
Requests/sec:  28463.94
Transfer/sec:     29.48MB